movq/openbsd/share/man/man4/man4.riscv64/smtcomphy.4
.\"	$OpenBSD: smtcomphy.4,v 1.1 2026/04/06 10:50:59 kettenis Exp $
.\"
.\" Copyright (c) 2026 Mark Kettenis <kettenis@openbsd.org>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: April 6 2026 $
.Dt SMTCOMPHY 4 riscv64
.Os
.Sh NAME
.Nm smtcomphy
.Nd SpacemiT PCIe 2.0 and USB 3.0 PHY
.Sh SYNOPSIS
.Cd "smtcomphy* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver controls the PCIe 2.0 and USB 3.0 PHY integrated on SpacemiT
SoCs.
.Sh SEE ALSO
.Xr intro 4 ,
.Xr dwpcie 4
.Sh HISTORY
The
.Nm
device driver first appeared in
.Ox 7.9 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Mark Kettenis Aq Mt kettenis@openbsd.org .
